Masmiseim36/nxpSDK/boards/frdmk32l2a4s/bootloader_examples/freedom_bootloader/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTB16 (number 62), J1[2]/U7[25]/D0/UART0_RX/FXIO_D16/UART1_RX_TGTMCU
  @{ */
#define UART0_POLLFORACTIVITY_RX_GPIO_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define UART0_POLLFORACTIVITY_RX_GPIO_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_POLLFORACTIVITY_RX_GPIO_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_PollForActivity(void);

/*! @name PORTB16 (number 62), J1[2]/U7[25]/D0/UART0_RX/FXIO_D16/UART1_RX_TGTMCU
  @{ */
#define UART0_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_RX_PIN 16U    /*!<@brief PORTB pin index: 16 */
                            /* @} */

/*! @name PORTB17 (number 63), J1[4]/U7[24]/D1/UART0_TX/FXIO_D17/UART1_TX_TGTMCU
  @{ */
#define UART0_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_TX_PIN 17U    /*!<@brief PORTB pin index: 17 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_RestoreDefault(void);

/*! @name PORTC1 (number 71), J4[12]/A5/ADC0_SE15/I2C1_SCL
  @{ */
#define I2C1_SCL_PORT PORTC /*!<@brief PORT device name: PORTC */
#define I2C1_SCL_PIN 1U     /*!<@brief PORTC pin index: 1 */
                            /* @} */

/*! @name PORTC2 (number 72), J4[10]/A4/ADC0_SE11/I2C1_SDA
  @{ */
#define I2C1_SDA_PORT PORTC /*!<@brief PORT device name: PORTC */
#define I2C1_SDA_PIN 2U     /*!<@brief PORTC pin index: 2 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C1_InitPins(void);

/*! @name PORTC1 (number 71), J4[12]/A5/ADC0_SE15/I2C1_SCL
  @{ */
#define I2C1_RESTOREDEFAULT_SCL_PORT PORTC /*!<@brief PORT device name: PORTC */
#define I2C1_RESTOREDEFAULT_SCL_PIN 1U     /*!<@brief PORTC pin index: 1 */
                                           /* @} */

/*! @name PORTC2 (number 72), J4[10]/A4/ADC0_SE11/I2C1_SDA
  @{ */
#define I2C1_RESTOREDEFAULT_SDA_PORT PORTC /*!<@brief PORT device name: PORTC */
#define I2C1_RESTOREDEFAULT_SDA_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C1_RestoreDefault(void);

/*! @name PORTB20 (number 66), J20[4]/SPI2_PCS0
  @{ */
#define SPI2_PCS0_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SPI2_PCS0_PIN 20U    /*!<@brief PORTB pin index: 20 */
                             /* @} */

/*! @name PORTB21 (number 67), J20[5]/SPI2_SCK
  @{ */
#define SPI2_SCK_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SPI2_SCK_PIN 21U    /*!<@brief PORTB pin index: 21 */
                            /* @} */

/*! @name PORTB22 (number 68), J20[6]/SPI2_SOUT
  @{ */
#define SPI2_SOUT_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SPI2_SOUT_PIN 22U    /*!<@brief PORTB pin index: 22 */
                             /* @} */

/*! @name PORTB23 (number 69), J20[7]/SPI2_SIN
  @{ */
#define SPI2_SIN_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SPI2_SIN_PIN 23U    /*!<@brief PORTB pin index: 23 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI2_InitPins(void);

/*! @name PORTB20 (number 66), J20[4]/SPI2_PCS0
  @{ */
#define SPI2_RESTOREDEFAULT_PCS0_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SPI2_RESTOREDEFAULT_PCS0_PIN 20U    /*!<@brief PORTB pin index: 20 */
                                            /* @} */

/*! @name PORTB21 (number 67), J20[5]/SPI2_SCK
  @{ */
#define SPI2_RESTOREDEFAULT_SCK_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SPI2_RESTOREDEFAULT_SCK_PIN 21U    /*!<@brief PORTB pin index: 21 */
                                           /* @} */

/*! @name PORTB22 (number 68), J20[6]/SPI2_SOUT
  @{ */
#define SPI2_RESTOREDEFAULT_SOUT_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SPI2_RESTOREDEFAULT_SOUT_PIN 22U    /*!<@brief PORTB pin index: 22 */
                                            /* @} */

/*! @name PORTB23 (number 69), J20[7]/SPI2_SIN
  @{ */
#define SPI2_RESTOREDEFAULT_SIN_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SPI2_RESTOREDEFAULT_SIN_PIN 23U    /*!<@brief PORTB pin index: 23 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI2_RestoreDefault(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
